<?php
	$section_names=['善良大便色的小白脸炙热我等','温柔闪耀的小白脸你眼中回归','温柔大便色的炙热回归','善良闪耀的放开炙热','主仆的炙热世界','温柔的的让我来你眼中我等','善良的炙热','温柔着的放开无人正常','可爱着的小白脸你眼中我等','可爱的你眼中','可爱着的让我来顾及','善良的那个炙热','善良的无人','可爱着的','可爱的的顾及回归','善良的小白脸无人我等','主仆的无人正常','可爱着的让我来炙热正常','可爱大便色的小白脸','主仆的世界','温柔大便色的那个顾及我等','可爱的顾及','主仆大便色的那个正常','可爱闪耀的让我来你眼中我等','温柔的正常','主仆大便色的小白脸炙热正常','主仆着的放开顾及我等','善良的的顾及','可爱的正常','温柔闪耀的那个','主仆的炙热回归','善良着的小白脸','可爱闪耀的小白脸','主仆的那个炙热','主仆的的让我来','善良的我等','主仆着的回归','可爱闪耀的让我来无人','善良的小白脸炙热回归','可爱着的放开你眼中我等','可爱着的顾及','可爱的放开无人回归','善良的让我来顾及','温柔的那个无人','温柔闪耀的放开正常','温柔闪耀的让我来顾及','善良闪耀的那个正常','温柔的那个炙热','主仆的那个无人','主仆闪耀的无人','可爱的炙热','善良的让我来炙热世界','主仆的的让我来顾及','主仆的炙热','主仆大便色的炙热正常','主仆的我等','善良的的顾及','可爱闪耀的顾及世界','可爱的小白脸无人','温柔的的放开顾及我等','主仆大便色的让我来我等','善良的顾及','可爱闪耀的世界','主仆的炙热','主仆的放开炙热','善良的小白脸无人','可爱大便色的让我来无人回归','可爱的你眼中','善良大便色的放开炙热','可爱的顾及','可爱闪耀的回归','善良的的让我来无人','可爱的无人','可爱着的放开炙热','善良闪耀的放开你眼中我等','温柔的','主仆的','可爱着的顾及正常','温柔着的','温柔着的炙热','善良的的那个炙热','善良闪耀的小白脸顾及','善良大便色的小白脸我等','温柔大便色的正常','温柔的的那个','主仆大便色的让我来','善良大便色的你眼中','可爱的世界','主仆着的我等','主仆的正常','可爱着的让我来我等','善良闪耀的我等','可爱的的正常','可爱的放开','温柔着的正常','主仆着的','可爱的无人','可爱着的让我来顾及','善良的让我来','主仆大便色的让我来无人','善良的无人','可爱闪耀的你眼中','主仆的','温柔闪耀的让我来你眼中世界','可爱的','善良着的顾及正常','可爱的炙热回归','温柔的那个无人','善良闪耀的那个炙热正常','温柔的的我等','善良的的让我来炙热世界','可爱的的那个','温柔着的让我来炙热世界','可爱闪耀的无人回归','善良大便色的你眼中我等','善良闪耀的小白脸我等','温柔的让我来无人世界','可爱的回归','温柔的放开','善良的让我来顾及正常','温柔大便色的顾及','温柔闪耀的','善良的的小白脸世界','可爱的小白脸','善良着的你眼中','主仆的让我来顾及回归','温柔大便色的','主仆着的那个无人正常','善良着的','主仆的的放开炙热','主仆的你眼中世界','可爱的的小白脸','善良大便色的小白脸顾及我等','温柔闪耀的回归','主仆的','善良大便色的回归','善良着的让我来世界','主仆着的你眼中','善良的','温柔的无人','温柔的放开顾及','善良的那个无人','温柔大便色的世界','温柔闪耀的回归','温柔大便色的那个顾及我等','主仆闪耀的我等','可爱着的放开炙热我等','善良的','可爱的的','可爱大便色的让我来','主仆的','可爱大便色的放开炙热正常','善良的小白脸正常','主仆闪耀的我等','主仆着的放开顾及回归','可爱的那个顾及我等','温柔闪耀的正常','温柔的的顾及世界','温柔的的顾及','善良的你眼中','善良的世界','温柔的世界','主仆大便色的','温柔大便色的小白脸世界','可爱的你眼中世界','主仆闪耀的让我来无人回归','可爱大便色的','温柔的放开我等','可爱的让我来','善良着的炙热正常','可爱的的','温柔的的放开世界','温柔的那个你眼中我等','主仆着的正常','温柔闪耀的那个无人','主仆的你眼中','可爱的放开回归','主仆的','主仆闪耀的小白脸世界','主仆大便色的正常','主仆的回归','主仆的让我来无人我等','主仆着的那个无人','主仆着的那个炙热正常','主仆闪耀的让我来顾及回归','可爱的的让我来你眼中','主仆大便色的顾及回归','可爱的那个回归','温柔的顾及世界','温柔的放开顾及','温柔的','主仆着的放开回归','可爱的的无人','善良的那个','善良的小白脸炙热','可爱的回归','善良的小白脸','主仆的','主仆大便色的世界','主仆的的回归','主仆的让我来顾及','可爱的那个你眼中我等','可爱着的那个顾及','主仆的让我来顾及回归','善良的小白脸你眼中','善良的小白脸无人回归','主仆的你眼中回归','善良的世界','温柔着的小白脸你眼中','温柔大便色的炙热世界','温柔的那个我等','主仆闪耀的小白脸你眼中回归','主仆大便色的让我来','主仆大便色的世界','温柔大便色的让我来无人','主仆的那个','善良的的你眼中','善良的无人正常','温柔大便色的你眼中世界','善良大便色的回归','主仆着的让我来世界','温柔着的世界','善良的让我来你眼中回归','温柔闪耀的那个顾及正常','善良的小白脸你眼中','可爱的小白脸我等','温柔的的让我来顾及','善良的让我来','善良闪耀的炙热回归','可爱的无人','可爱的放开炙热我等','主仆闪耀的让我来世界','善良闪耀的让我来','主仆的的让我来炙热','可爱的的放开','善良的','温柔的','善良的小白脸正常','善良的的小白脸正常','可爱的我等','可爱闪耀的你眼中正常','主仆的让我来回归','可爱的那个无人','可爱的那个我等','主仆的小白脸炙热','温柔着的放开我等','主仆闪耀的让我来','温柔着的顾及','温柔的正常','主仆着的','可爱闪耀的','可爱着的世界','可爱的放开','善良的','可爱大便色的','可爱闪耀的小白脸顾及回归','善良的的炙热世界','主仆大便色的你眼中世界','主仆着的我等','可爱的的放开无人正常','温柔的放开顾及世界','可爱的顾及','可爱着的那个我等','可爱着的让我来炙热','可爱的世界','主仆的的顾及我等','可爱闪耀的让我来你眼中正常','善良的你眼中回归','温柔的你眼中','温柔闪耀的','善良的那个正常','温柔闪耀的无人','主仆的顾及我等','温柔闪耀的让我来你眼中','主仆着的回归','可爱的的小白脸顾及世界','温柔的回归','温柔大便色的','善良着的那个回归','善良着的你眼中','可爱大便色的正常','主仆的炙热回归','主仆的','温柔大便色的那个顾及','善良大便色的顾及正常','主仆的我等','主仆闪耀的炙热我等','主仆的的顾及','温柔大便色的回归','可爱的的小白脸炙热回归','温柔的顾及','主仆的的','可爱闪耀的正常','可爱的你眼中正常','可爱的','温柔的小白脸','主仆的','可爱的顾及','可爱大便色的那个','可爱的那个炙热'];
    $section_names1=['可爱的的让我来','善良着的那个','主仆闪耀的无人世界','可爱闪耀的正常','善良闪耀的','善良的那个我等','主仆的的小白脸无人','温柔的让我来无人','可爱的的放开','可爱的的你眼中','主仆的小白脸正常','善良着的小白脸无人世界','主仆的','善良的的小白脸回归','善良闪耀的小白脸世界','温柔的让我来回归','善良的的放开无人','善良着的放开世界','可爱的放开世界','可爱的的我等','温柔着的那个顾及','善良的我等','主仆的的','温柔的的无人正常','温柔的的无人','可爱的的炙热世界','主仆着的','主仆的的那个','温柔的放开','温柔大便色的顾及','可爱闪耀的顾及','善良的无人世界','可爱的','可爱的世界','可爱的','善良的放开炙热','主仆着的','善良大便色的你眼中我等','主仆的让我来正常','可爱闪耀的放开','主仆的的放开你眼中','主仆的放开顾及世界','主仆的的那个你眼中正常','善良的无人正常','可爱的的放开你眼中','主仆着的','温柔的那个','善良的世界','主仆的的让我来无人正常','温柔着的放开你眼中世界','善良的的','可爱的放开','主仆的顾及世界','温柔大便色的放开','可爱的炙热回归','善良大便色的','可爱的的','可爱的小白脸','可爱大便色的放开正常','主仆闪耀的','可爱闪耀的顾及','善良的那个你眼中','主仆的让我来无人','主仆的你眼中我等','可爱大便色的让我来回归','可爱闪耀的那个','温柔的的小白脸','主仆闪耀的那个炙热','温柔的放开你眼中正常','可爱的小白脸回归','温柔的顾及','可爱闪耀的顾及','善良闪耀的小白脸回归','主仆闪耀的那个世界','主仆的我等','善良的','善良闪耀的回归','温柔着的让我来正常','主仆的的让我来顾及回归','温柔大便色的小白脸你眼中','主仆的你眼中','主仆大便色的那个','温柔的的那个','主仆大便色的世界','可爱的顾及','温柔的小白脸正常','可爱着的','善良的那个你眼中','善良的无人我等','可爱的小白脸你眼中世界','善良着的我等','温柔的的顾及世界','善良的小白脸','主仆的小白脸世界','可爱闪耀的顾及世界','可爱大便色的正常','温柔着的让我来顾及我等','主仆的顾及回归','善良闪耀的放开顾及','温柔着的让我来我等','善良着的你眼中世界','善良大便色的你眼中世界','善良着的炙热','可爱的的','主仆着的让我来无人世界','主仆的回归','可爱的让我来顾及','可爱闪耀的让我来正常','可爱的你眼中','可爱着的小白脸正常','善良的那个我等','温柔的那个世界','善良闪耀的无人我等','善良的','主仆闪耀的小白脸我等','温柔的正常','善良的小白脸炙热正常','善良的你眼中回归','可爱闪耀的小白脸顾及','善良的小白脸无人','主仆闪耀的炙热','温柔的放开顾及世界','善良的无人','可爱大便色的那个我等','善良着的放开无人世界','善良的那个','可爱大便色的无人','可爱着的','善良的那个世界','可爱着的炙热回归','善良大便色的放开无人我等','温柔着的我等','主仆着的那个无人回归','主仆闪耀的无人我等','主仆的的无人正常','善良的那个','善良的的那个','温柔的让我来','可爱的放开无人','温柔的顾及','善良着的小白脸','主仆的那个','可爱的小白脸','主仆的无人世界','可爱的顾及我等','可爱的那个回归','主仆的的','主仆着的正常','善良的的小白脸回归','可爱的','主仆闪耀的回归','主仆大便色的我等','可爱的的无人','可爱大便色的小白脸','可爱的','可爱大便色的顾及回归','善良的顾及','主仆大便色的','主仆着的放开顾及','可爱闪耀的','可爱的那个无人我等','主仆的顾及世界','主仆闪耀的你眼中世界','可爱闪耀的世界','善良闪耀的那个炙热','可爱的放开世界','可爱大便色的那个顾及回归','主仆的你眼中','主仆闪耀的放开世界','可爱大便色的那个无人','主仆着的','主仆的的让我来无人回归','可爱的炙热回归','善良大便色的放开炙热我等','主仆的','可爱的放开世界','主仆的的世界','主仆大便色的无人','善良的的让我来','主仆大便色的无人世界','温柔着的','主仆的正常','可爱着的炙热','主仆着的那个','善良着的无人正常','主仆闪耀的那个炙热','善良着的炙热我等','主仆的放开无人回归','善良的的放开无人','善良的小白脸无人','可爱大便色的那个无人','主仆大便色的小白脸我等','可爱大便色的我等','可爱的小白脸','温柔的那个','温柔的的世界','主仆的的炙热','可爱大便色的你眼中世界','可爱的放开炙热','主仆的让我来无人世界','可爱闪耀的世界','可爱大便色的小白脸炙热正常','善良的正常','可爱的无人','温柔闪耀的','善良的的小白脸我等','温柔的正常','温柔的的小白脸正常','主仆的的那个','主仆的','善良着的放开你眼中','可爱着的','可爱的正常','善良大便色的你眼中世界','可爱的我等','温柔的的','可爱着的让我来你眼中','善良大便色的那个','善良的炙热世界','可爱闪耀的顾及回归','善良闪耀的','温柔大便色的','可爱闪耀的无人世界','温柔着的小白脸回归','主仆着的顾及','温柔着的顾及','可爱的放开顾及我等','善良的小白脸我等','可爱着的小白脸回归','主仆大便色的小白脸你眼中我等','温柔的小白脸正常','可爱的的小白脸','主仆闪耀的小白脸','善良闪耀的','善良大便色的你眼中世界','可爱大便色的无人我等','主仆闪耀的你眼中回归','可爱大便色的放开你眼中回归','善良的无人','温柔着的放开你眼中世界','善良的放开回归','主仆大便色的','可爱的炙热世界','主仆的我等','主仆着的炙热世界','温柔闪耀的顾及正常','可爱闪耀的放开无人','主仆的无人','可爱的顾及','温柔的你眼中世界','可爱大便色的','善良着的放开我等','善良的你眼中我等','可爱的你眼中','可爱闪耀的放开你眼中回归','可爱的无人世界','主仆的让我来我等','善良的我等','温柔的让我来','主仆闪耀的让我来你眼中','主仆的的你眼中','可爱的小白脸无人','可爱闪耀的回归','善良的放开','善良的的让我来炙热我等','善良闪耀的我等','可爱闪耀的你眼中','主仆着的放开我等','温柔着的顾及','善良大便色的顾及正常','温柔的的','善良的的','主仆的','可爱着的那个顾及世界','可爱的小白脸回归','善良的放开世界','善良的世界','善良的那个我等','温柔的你眼中','善良着的无人','温柔大便色的小白脸无人回归','温柔的的放开世界','温柔闪耀的放开你眼中','温柔的让我来你眼中我等','可爱着的那个我等','可爱着的放开无人我等','主仆闪耀的小白脸炙热','善良的顾及','温柔闪耀的小白脸回归','主仆的我等','主仆的的放开','温柔闪耀的放开','善良的放开','善良闪耀的世界','可爱的炙热回归','善良着的小白脸我等','温柔的世界','温柔的小白脸炙热','主仆的的放开你眼中','温柔的'];
//    var_dump($section_names1);
	
	require("../data/init.php");

//    getArr();
	function getArr(){
	        $section_name1=["主仆","可爱","温柔","善良","性感","金丝雀"];
            $section_name2=["闪耀","着","大便色","的","土豪","灵结"];
            $section_name3=["放开","那个","小白脸","让我来","捆绑","play"];
            $section_name4=["无人","顾及","你眼中","炙热","惨无人道","杀害"];
            $section_name5=["回归","正常","世界","我等","君来","未来"];
            $section_names = [];
    		for($i=0;$i<300;$i++){
    		 $section_name = $section_name1[mt_rand(0,5)].
    		 (mt_rand(0,5)>3?$section_name2[mt_rand(0,5)]:"").
    		 "的".
    		 (mt_rand(0,5)>3?$section_name3[mt_rand(0,5)]:"").
    		 (mt_rand(0,5)>3?$section_name4[mt_rand(0,5)]:"").
    		 (mt_rand(0,5)>3?$section_name5[mt_rand(0,5)]:"");
    		 $section_names[count($section_names)]=$section_name;
    		 }
//    		 var_dump($section_names);
//    		var msg = '';
//    		for(var f of section_names){
//    		    msg +="'"+ f+"',";
//    		}

	}

	for($j=2;$j<10;$j++){
	            $section_name1=["主仆","可爱","温柔","善良","性感","金丝雀"];
                $section_name2=["闪耀","着","大便色","的","土豪","灵结"];
                $section_name3=["放开","那个","小白脸","让我来","捆绑","play"];
                $section_name4=["无人","顾及","你眼中","炙热","惨无人道","杀害"];
                $section_name5=["回归","正常","世界","我等","君来","未来"];
                $section_names = [];
        		for($i=0;$i<300;$i++){
        		 $section_name = $section_name1[mt_rand(0,5)].
        		 (mt_rand(0,5)>3?$section_name2[mt_rand(0,5)]:"").
        		 "的".
        		 (mt_rand(0,5)>3?$section_name3[mt_rand(0,5)]:"").
        		 (mt_rand(0,5)>3?$section_name4[mt_rand(0,5)]:"").
        		 (mt_rand(0,5)>3?$section_name5[mt_rand(0,5)]:"");
        		 $section_names[count($section_names)]=$section_name;
        		 }
        		 $sql = "DROP TABLE IF EXISTS story".$j."_section";
        		 mysqli_query($conn,$sql);
	    $sql = "CREATE TABLE story".$j."_section(
  	        sid        INT PRIMARY KEY auto_increment,
	        story_id   INT NOT NULL DEFAULT 0,
	        section_name VARCHAR(128) NOT NULL DEFAULT ''
	    )";
	    mysqli_query($conn,$sql);
	    for($k=0;$k<300;$k++){
	        $section_name = $section_names[$k];
		    $sql = "insert into story".$j."_section(story_id,section_name) values($j,'$section_name')";
	        mysqli_query($conn,$sql);
	    }

//		echo $sql;

	}

	
	//$a = mt_rand(0,1); 取随机数
	//echo $a;
?>